Repository: miyabee-craft/Gyro3dMonitor
Catalog: Gyro3dMonitor/Resources/Resource.*.resx
Languages: es, ja, ko

# button_Close
source: Close
es: Cerrar
ja: 閉じる
ko: 닫기

# button_DisplayModel
source: Displaying a view
es: Mostrando vista
ja: ビューの表示
ko: 보기 표시

# button_LoadModel
source: Loading STL model
es: Cargando modelo STL
ja: STLモデルの読込み
ko: STL 모델 로드

# button_MonitorOnOff
source: Gyro monitor start
es: Iniciar monitor de giroscopio
ja: ジャイロモニタ開始
ko: 자이로 모니터 시작

# button_SaveImage
source: Capture & save
es: Capturar y guardar
ja: キャプチャ・保存
ko: 캡처 및 저장

# checkBox_CheckGround
source: Check floor
es: Comprobar suelo
ja: 市松模様床
ko: 바닥 확인

# checkBox_CoordinateAxes
source: Coordinate axes
es: Ejes de coordenadas
ja: 座標軸
ko: 좌표축

# checkBox_MeshGround
source: Mesh floor
es: Suelo de malla
ja: メッシュグランド
ko: 메쉬 바닥

# checkBox_shadowEnable
source: Shadow (floor height fixed at zero)
es: Sombra (altura del suelo fija en cero)
ja: 影（床高さゼロ固定）
ko: 그림자 (바닥 높이 0 고정)

# checkBox_SkyDome
source: Skydome --->
es: Cúpula celeste ---->
ja: 青空ドーム---->
ko: 하늘 돔 ---->

# label_BackgroundColor
source: Background:
es: Fondo:
ja: 背景:
ko: 배경:

# label_ColorPalette
source: Color palette:
es: Paleta de colores:
ja: カラーパレット:
ko: 색상 팔레트:

# label_GyroOperation
source: [ Gyro operation ]
es: [Operación de giroscopio]
ja: 【 ジャイロ操作 】
ko: 【자이로 작동】

# label_Hight
source: ] Hight:
es: ］Altura:
ja: ］高さ:
ko: ］높이:

# label_LightingColor
source: Lighting:
es: Iluminación:
ja: ライティング:
ko: 조명:

# label_MaterialColor
source: Material:
ja: マテリアル:
ko: 소재:

# label_Port
source: Port:
es: Puerto:
ja: 通信ポート:
ko: 통신 포트:

# label_Radius
source: Radius:
es: Radio:
ja: 半径:
ko: 반지름:

# label_RotationMethod
source: Rotation method:
es: Método de rotación:
ja: 回転法:
ko: 회전 방법:

# label_Timeout
source: Timeout (s):
ja: タイムアウト(秒):
ko: 타임아웃 (초):

# label_ViewerOperation
source: [ Viewer operation ]
es: [Operación del visor]
ja: 【 ビューワ操作 】
ko: 【뷰어 작동】

# label_ViewportSettings
source: [ Viewport settings (VP ​​is auto) ]
es: [Configuración de la ventana de vista]
ja: 【 ビューポート設定(VPは自動) 】
ko: 【뷰포트 설정 (VP 자동)】

# radioButton_Dark
source: Dark
es: Oscuro
ja: ダーク
ko: 어두운

# radioButton_Light
source: Light
es: Claro
ja: ライト
ko: 밝은

# radioButton_LightingColor
source: Lighting color:
es: Iluminación:
ja: ライティングカラー:
ko: 조명 색상:

# radioButton_MaterialColor
source: Material color:
es: Material:
ja: マテリアルカラー:
ko: 재질 색상:

# radioButton_RGBColor
source: Background color:
es: Fondo:
ja: 背景色:
ko: 배경 색상:

# radioButton_Texture
source: Texture:
es: Textura:
ja: テクスチャー:
ko: 텍스처:

# comboBox_RotationMethod_Items
source: Quaternion;Euler Angles
es: Cuaternión; Ángulos de Euler
ja: クォータニオン;オイラー角
ko: 사원수; 오일러 각도

# button_MonitorOff
source: Gyro monitor cancel
es: Cancelar monitor de giroscopio
ja: ジャイロモニタ中断
ko: 자이로 모니터 취소

# button_DisplayModelUpdate
source: Update the view
es: Actualizar vista
ja: ビューの更新
ko: 보기 업데이트

# StateMonitor_Receiving
source: RECEIVING
es: RECIBIENDO
ja: 受信中
ko: 수신 중

# StateMonitor_Offline
source: OFFLINE
es: DESCONECTADO
ja: オフライン
ko: 오프라인

# StateMonitor_Waiting
source: WAITING
es: ESPERANDO
ja: 受信待ち
ko: 수신 대기

# StateMonitor_Receiving_Unit
source: sec
es: seg
ja: 秒
ko: 초

# msgMain_1
source: Importing a model file
es: Importando archivo de modelo
ja: モデルファイルの読み込み
ko: 모델 파일 가져오기

# msgMain_2
source: STL Model (*.stl)|*.stl
es: Modelo STL (*.stl)|*.stl
ja: STLモデル (*.stl)|*.stl
ko: STL 모델 (*.stl)|*.stl

# msgMain_3
source: File not found.
es: Archivo no encontrado.
ja: ファイルが見つかりません。
ko: 파일을 찾을 수 없습니다.

# msgMain_4
source: Importing image files
es: Importando archivos de imagen
ja: 画像ファイルの読み込み
ko: 이미지 파일 가져오기

# msgMain_5
source: Image file (*.jpg)|*.jpg
es: Archivo de imagen (*.jpg)|*.jpg
ja: 画像ファイル (*.jpg)|*.jpg
ko: 이미지 파일 (*.jpg)|*.jpg

# msgMain_6
source: File not found.
es: Archivo no encontrado.
ja: ファイルが見つかりません。
ko: 파일을 찾을 수 없습니다.

# msgMain_7
source: There is no capture image.
es: No hay imagen capturada.
ja: キャプチャー画像がありません。
ko: 캡처된 이미지가 없습니다.

# msgMain_8
source: There is no image data.
es: No hay datos de imagen.
ja: 画像データがありません。
ko: 이미지 데이터가 없습니다.

# msgMain_9
source: Do you want to save the captured image?
es: ¿Desea guardar la imagen capturada?
ja: キャプチャー画像を保存しますか？
ko: 캡처된 이미지를 저장하시겠습니까?

# msgMain_10
source: PNG image (*.png)|*.png|JPEG image (*.jpg)|*.jpg
es: Imagen PNG (*.png)|*.png|JPEG (*.jpg)|*.jpg
ja: PNG画像 (*.png)|*.png|JPEG画像 (*.jpg)|*.jpg

# msgMain_11
source: An error has occurred:
es: Ocurrió un error:
ja: エラーが発生しました:
ko: 오류가 발생했습니다:

# msgMain_12
source: The model is not loaded.
es: El modelo no está cargado.
ja: モデルが読み込まれていません。
ko: 모델이 로드되지 않았습니다.

# msgMain_13
source: The view is not visible.
es: La vista no es visible.
ja: ビューが表示されていません。
ko: 뷰가 표시되지 않습니다.

# msgView_1
source: The gyro monitor has been interrupted.
es: El monitor giroscópico ha sido interrumpido.
ja: ジャイロモニタを中断しました。
ko: 자이로 모니터가 중단되었습니다.

# msgView_2
source: The gyro sensor could not be received (timed out).
es: No se pudo recibir el sensor giroscópico (tiempo agotado).
ja: ジャイロセンサを受信できませんでした(タイムアウト)。
ko: 자이로 센서를 수신할 수 없습니다 (타임아웃).

# msgView_3
source: Communication was interrupted.
es: La comunicación fue interrumpida.
ja: 通信を中断しました。
ko: 통신이 중단되었습니다.

# msgView_4
source: Communication was interrupted.
es: La comunicación fue interrumpida.
ja: 通信を中断されました。
ko: 통신이 중단되었습니다.

# msgView_5
source: Socket error:
es: Error de socket:
ja: ソケットエラー:
ko: 소켓 오류:

# StateMonitor_Timeout
source: TIMEOUT
ja: タイムアウト
ko: 타임아웃

# StateMonitor_Cancel
source: CANCEL
es: CANCELAR
ja: キャンセル
ko: 취소
